/*
 * Click nbfs://nbhost/SystemFileSystem/Templates/Licenses/license-default.txt to change this license
 * Click nbfs://nbhost/SystemFileSystem/Templates/Classes/Main.java to edit this template
 */
package vanocecvicclock;
import java.util.Scanner;

/**
 *
 * @author ivan
 */
public class Buzuk_Ivan_Vanoce {
    static Scanner sc = new Scanner(System.in);

    /**
     * @param args the command line arguments
     */
    public static void main(String[] args) {
        System.out.println("Today is Christmas's Eve");
        System.out.println("what time is it? (print a specific hour in 0-24 format");
        int time = sc.nextInt();
        if (time >= 0 && time < 25){
            if (time  == 0 || time == 12 || time ==24){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜🟥⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜🟥⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else if(time == 12){
                    
                }
            }
            else if (time  == 1 || time == 13 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜🟥⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜🟥⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
            else if (time  == 2 || time == 14 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜⬜🟥🟥⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
             else if (time  == 3 || time == 15 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥🟥🟥⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
             else if (time  == 4 || time == 16 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜🟥🟥⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
            else if (time  == 5 || time == 17 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜🟥⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜🟥⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
            else if (time  == 6 || time == 18 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜🟥⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜🟥⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
            else if (time  == 7 || time == 19 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜🟥⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛🟥⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
            else if (time  == 8 || time == 20 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜🟥🟥⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
            else if (time  == 9 || time == 21 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛🟥🟥🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
            else if (time  == 10 || time == 22 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜🟥⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜🟥🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
            else if (time  == 11 || time == 23 ){
                System.out.println("  🟩🟩🟩     🟩🟩🟩🟩   ");
                System.out.println(" 🟩🟩🟩🟩🟩  🟩🟩🟩🟥🟩🟩  ");
                System.out.println("🟩🟩🟥🟫🟫🟫🟫🟫🟩🟩🟩🟥🟩🟩 ");
                System.out.println(" 🟩🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩🟩🟩 ");
                System.out.println(" 🟫🟫⬛🟥⬜⬜⬛⬜🟫🟫🟩🟩 🟥");
                System.out.println(" 🟫⬜⬜🟥⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫⬛⬜⬜🟥⬜⬜⬛⬜🟫🟩🟫🟥 ");
                System.out.println(" 🟫⬜⬜⬜⬜⬜⬜⬜⬜🟫🟫🟫🟥🟥");
                System.out.println(" 🟫🟫⬛⬜⬜⬜⬛⬜🟫🟩🟩🟩 🟥  ");
                System.out.println("   🟫🟫⬜⬛⬜⬜🟫🟩🟩🟩   ");
                System.out.println("     🟫🟫🟫🟫🟫🟩🟩🟩    ");
                System.out.println("   🟥🟥🟫🟫 🟥🟥🟫🟫    ");
                if (time == 0){
                    
                }
                else{
                    
                }
            }
          
        }
    }
    
}
